/* 
    练习7-11创建一个程序，分别对代码清单7-11和代码
清单7-12进行改写，从0.0递增到1.0，求递增后所有值的
累计。并注意对比二者的运行结果。
*/
#include <stdio.h>

int main(void)
{
    /* 定义、初始化 */
    int i = 0;
    float x_1 = 0.0;/* 用来积累浮点误差 */
    float x_2 = 0.0;/* 用来表示即用即取的浮点数 */
    double sum_1 = 0.0;/* x_1值的累计 */
    double sum_2 = 0.0;/* x_2值的累计 */

    for(; i <= 100 ; i++, x_1 += 0.01)
    {
        /* x_1表示:浮点数计算产生的误差会积累*/
        /* x_2表示:循环判断基准用整数,浮点数即用即取,避免积累误差的模式 */
        x_2 = i/100.0;
        printf("x_1 = %f\t", x_1);    printf("x_2 = %f\n", x_2);   
    
        sum_1 += (double)x_1;
        sum_2 += (double)x_2;
    }
    
    printf("x_1的和(浮点数计算误差累计) = %lf\n", sum_1);   
    printf("x_2的和(整数计算后求浮点数) = %lf\n", sum_2); 

    return 0;
}