/* 
    练习11-8 编写如下函数,删除字符串str内所有的数字字符
        void del_digit(char *str){codes}
    例如,如果接受"AB1C9",就返回"ABC".
    注意不要使用下标运算符.

    思路1:先检查原字符串数组s1中有没有数字字符('0'~'9').
        如无则原样退出.
        如有:再复制一个等长数组s2,将s1分段映射到s2.
            比如"ABCD3EFG2HI5JK467L"
            A-D正常(*s2 = *s1),E-G用新映射(*s2 = *s1 + 1),
            H-I用映射(*s2 = *s1 + 2),J-K用映射(*s2 = *s1 + 3),
            L和'\0'用映射(*s2 = *s1 + 6).
                临界点无外乎s1中数字字符的下标,可以用一个数组(也可以是链表-按需创建
                ,可惜我还不会)单独存储.
    思路2:这样至少要遍历两遍,最坏的情况得额外创建两个和s1等长的数组.
        直接创建两个指针(p1和p2),同时从首元素开始,p1和p2同步递增以遍历数组,
        p2每碰到一个元素都要判定是否是数字字符,p1不动,p2自增一次(指向下一个元素),
        再判定p2所指是否是...直到p2所指不是数字字符,自此开始将p2所指元素赋给p1,
        直到p2碰到'\0':将'\0'复制给p1所指,然后p1自增以p1将剩余元素全部写'\0'.

*/

int is_digit(const char *s);/* 返回1表示是数字字符,返回0表示不是 */
void del_digit(char *str);




void del_digit(char *str)
{
    int len = strlen(str) + 1;
    int i = 0;
    char *tmp = str;

    

}

int is_digit(const char *s)/* 返回1表示是数字字符,返回0表示不是 */
{
    int result = 0;
    if(*s >= '0' && *s <= '9')
    {
        result = 1;
    }

    return result;
}